# CouplerRequiredRemoveFromGroup Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..CouplerRequiredRemoveFromGroup Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
The coupler is invalid in group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CouplerRequiredRemoveFromGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerRequiredRemoveFromGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CouplerRequiredRemoveFromGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace